var problem_options = function () {
  var option = [
    [
      { value: "01", text: "ไม่มีคนอุปการะ/ไร้ที่พึ่ง" }, //1
      { value: "99", text: "ขอทาน" },   //2
      { value: "18", text: "เร่ร่อน ไม่มีที่อยู่เป็นหลักเป็นแหล่ง" },
    ],  //3
    [
      { value: "27", text: "ไม่มีสถานะทางทะเบียนราษฎร์" }, //4
      { value: "99", text: "ไม่มีทุนประกอบอาชีพ" },//5
      { value: "99", text: "รายได้ไม่เพียงพอแก่การครองชีพ" },//6
    ],
    [
      { value: "99", text: "ไม่มีงานทำ" },
      { value: "99", text: "ถูกเลิกจ้าง/ถูกนายจ้างเอารัดเอาเปรียบ" },//8
      { value: "99", text: "มีหนี้สิ้น" },
    ],
    [
      { value: "99", text: "ไม่มีที่อยู่อาศัย/ที่ทำกิน" },
      { value: "17", text: "ที่อยู่อาศัยไม่มั่นคง" },//11
      { value: "08", text: "ไม่มีทุนการศึกษา" },
    ],
    [
      { value: "10", text: "ไม่ได้รับการศึกษาตามเกณฑ์" },
      { value: "99", text: "ขาดโอกาสทางการศึกษา" },
      { value: "99", text: "เป็นหัวหน้าครอบครัวยากจน" },
    ],
    [
      { value: "99", text: "มีบุตรมาก" },
      { value: "99", text: "ไม่สามารถเลี้ยงดูบุตรได้" },
      { value: "12", text: "เด็กอยู่ในครอบครัวยากจน" },
    ],
    [
      { value: "07", text: "ครอบครัวแตกแยก" },
      { value: "06", text: "ตั้งครรภ์นอกสมรส" },//20-1
      { value: "99", text: "เลี้ยงดูไม่เหมาะสม" }
    ],
    [
      { value: "14", text: "ครอบครัวมีภาระการเลี้ยงดูผู้ประสบปัญหา (อาทิ เด็ก คนพิการ ผู้ติดเชื่อเอดส์ ผู้ติดยาเสพติด)" },
    ],

    [
      { value: "02", text: "ผู้ปกครองหรือผู้ดูแลไม่สามารถอุปการะเลี้ยงดูได้" },
      { value: "03", text: "ผู้ปกครองหรือผู้ดูแลมีพฤติกรรมไม่เหมาะสม" },
    ],
    [
      { value: "99", text: "ได้รับผลกระทบจากการที่คนในครอบครัวต้องโทษจำคุก" },
      { value: "05", text: "ช่วยเหลือตัวเองไม่ได้ในชีวิตประจำวัน" },
    ],
    [
      { value: "26", text: "เคยต้องโทษและประสบปัญหาการใช้ชีวิตในสังคม" },
      { value: "99", text: "ได้รับผลกระทบจากภัยพิบัติ" },
    ],
    [
      { value: "04", text: "ป่วยเป็นโรคร้ายแรง/เจ็บป่วยเรื้อรัง" },
      { value: "25", text: "ติดยาเสพติด" },
      { value: "99", text: "หลงลืมชราภาพ" },
    ],
    [
      { value: "99", text: "ขาดเงินจัดการศพผู้สูงอายุ" },
      { value: "99", text: "ไม่มีค่าพาหนะเดินทางกลับภูมิลำเนา" },
      { value: "99", text: "พ้นโทษ" },
    ]
  ];
  return option;
}
//'เงินช่วยเหลือ
var moneyForHelp_option = function () {
  var moneyForHelp = [
    [
      { value: "99", text: "เงินทุนประกอบอาชีพ" },
      { value: "03", text: "เงินสงเคราะห์ครอบครัว" },
      { value: "99", text: "เงินสงเคราะห์เบี้ยยังชีพ" },
    ],
    [
      { value: "01", text: "เงินทุนการศึกษา" },
      { value: "99", text: "เงินค่าใช้จ่ายในการรักษาพยาบาล" },
      { value: "99", text: "เงินค่าเดินทางกลับภูมิลําเนา" },
    ],
    [
      { value: "99", text: "เงินสงเคราะห์จัดการศพผู้สูงอายุ" },
      { value: "99", text: "เงินสงเคราะห์ช่วยเหลือผู้ติดเชื้อเอดส์" },

    ],
    [
      { value: "99", text: "ค่าใช้จ่ายในการเดินทางไปรักษาพยาบาล" },
      { value: "99", text: "เงินสงเคราะห์คนพิการ" },
    ],
    [
      { value: "99", text: "เงินสงเคราะห์ผู้มีรายได้น้อยและคนไร้ที่พึ่ง" },
      { value: "99", text: "อื่นๆ ระบุ....................................." },
    ]
  ];
  return moneyForHelp
}

//สิ่งของ
var objectForHep_option = function () {
  var objectForHelp = [
    [
      { value: "99", text: "อุปกรณ์การศึกษา" },
      { value: "99", text: "อาหาร" },
      { value: "99", text: "เครื่องนุ่งห่ม" },
    ],
    [
      { value: "99", text: "นมผงสําหรับเด็ก" },
      { value: "99", text: "ยารักษาโรค" },
      { value: "99", text: "เครื่องอุปโภคและบริโภค" },
    ],
    [
      { value: "99", text: "อื่นๆระบุ....................................." },
    ]
  ];
  return objectForHelp
}
//ความช่วยเหลืออื่นๆ
var otherForHep_option = function () {
  var otherForHep = [
    [
      { value: "99", text: "ส่งไปทํากายภาพบําบัด" },
      { value: "07", text: "ส่งเข้ารับการรักษา/บําบัด" },
      { value: "99", text: "ติดตามหาญาติ" },
    ],
    [
      { value: "90", text: "ส่งเข้าฝึกอาชีพ" },
      { value: "99", text: "จัดหาอาชีพ" },
      { value: "06", text: "จัดหาที่อยู่อาศัย/ที่ทํากิน" },
    ],
    [
      { value: "12", text: "ช่วยเหลือทางด้านกฎหมาย/คุ้มครองสิทธิ" },
      { value: "99", text: "รับเข้าสถานสงเคราะห์ /สถานคุ้มครอง" },
      { value: "99", text: "ให้คําปรึกษา/แนะนํา" },
    ],
    [
      //{ value: "99", text: "รับเข้าสถานสงเคราะห์ /สถานคุ้มครอง" },
      { value: "99", text: "ขอบุตรบุญธรรม/ครอบครัวอุปถัมภ์" },
      { value: "99", text: "ส่งกลับภูมิลําเนา" },
      { value: "99", text: "อื่นๆระบุ..................................." },
    ]
  ];
  return otherForHep
}

